The angle of the hook at the end.
  Namespace:   Autodesk.Revit.DB.Structure
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2012
 Syntax
  C#
public int HookAngle1 { get; set; }
  Visual Basic
Public Property HookAngle1 As Integer
	Get
	Set
  Visual C++
public:
property int HookAngle1 {
	int get ();
	void set (int value);
}
 See Also
  RebarBendData Class
  Autodesk.Revit.DB.Structure Namespace